2026-05-18-ten-books-that-shaped-how-i-think.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="The books that shaped how I think.">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.birkey.co/rss.xml"
      title="RSS feed for https://www.birkey.co/">
<title>Ten Books That Shaped How I Think</title>
<link href="static/style.css" rel="stylesheet" type="text/css" />
	   <link rel="apple-touch-icon" sizes="180x180" href="static/apple-touch-icon.png">
	   <link rel="icon" type="image/png" sizes="32x32" href="static/favicon-32x32.png">
	   <link rel="icon" type="image/png" sizes="16x16" href="static/favicon-16x16.png">
	   <link rel="manifest" href="/site.webmanifest">
	   <link rel="mask-icon" href="static/safari-pinned-tab.svg" color="#5bbad5">
	   <link rel="alternate" type="application/rss+xml" title="RSS Feed for birkey.co" href="/rss.xml">
	   <meta name="author" content="Kasim Tuman">
	   <meta name="referrer" content="no-referrer">
	   <meta name="msapplication-TileColor" content="#da532c">
	   <meta name="theme-color" content="#ffffff">
	   <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
	   <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
	  </head>
<body>
<div id="preamble" class="status"><br><center>
       <div style="display: inline-block; vertical-align:middle;">
  <a href="https://www.birkey.co/index.html" style="text-decoration: none;"><b>BIRKEY CONSULTING</b><br>
  </a><hr/><div style="text-align: justify;display: inline-block; width: 100%;">
<a class="title" href="https://github.com/oneness">ABOUT</a> &nbsp;<a class="title" href="https://www.birkey.co/rss.xml">RSS</a> &nbsp;<a class="title" href="https://www.birkey.co/projects.html">PROJECTS</a> &nbsp;<a class="title" href="https://www.birkey.co/archive.html">ARCHIVE</a></div></div>
  </center><br><br>
  <div style="margin-bottom: 3ch;text-transform: none;"></div></div>
<div id="content">
<div class="post-date">18 May 2026</div><h1 class="post-title"><a href="https://www.birkey.co/2026-05-18-ten-books-that-shaped-how-i-think.html">Ten Books That Shaped How I Think</a></h1>
<p>
I was recently asked for book recommendations and realized I have
never written down the ones that actually changed how I think. Not the
ones that taught me a language or a framework. The ones that shifted
something in me as an engineer. Here they are, in no particular order.
</p>
<div id="outline-container-org34e833d" class="outline-2">
<h2 id="org34e833d">1. A Philosophy of Software Design — John Ousterhout</h2>
<div class="outline-text-2" id="text-org34e833d">
<p>
Short, opinionated, and right about most things. The core idea is
<i>Deep Modules</i>: hide complexity behind simple interfaces. This is
ETC from another angle. If your module has a complex surface, every
consumer pays that tax forever. Make the surface small and the
internals can evolve freely. I read it in a weekend. I have been
thinking about it for years.
</p>
</div>
</div>
<div id="outline-container-org639a02b" class="outline-2">
<h2 id="org639a02b">2. Thinking in Systems: A Primer — Donella Meadows</h2>
<div class="outline-text-2" id="text-org639a02b">
<p>
I already thought in systems before reading this. What Meadows gave me
was the vocabulary. Stocks and flows. Feedback loops. Leverage
points. The places to intervene in a system, ranked from least to most
effective. When I write about NixOS or Emacs or OneLoop, I am
reaching for these ideas even when I do not name them directly. Short
and elegant.
</p>
</div>
</div>
<div id="outline-container-orgcc43647" class="outline-2">
<h2 id="orgcc43647">3. The Art of Doing Science and Engineering — Richard Hamming</h2>
<div class="outline-text-2" id="text-orgcc43647">
<p>
Hamming spent decades at Bell Labs studying what separates great
scientists from merely good ones. His central question: why do so few
people make significant contributions while so many are forgotten? The
answer is mostly about how you allocate your attention and whether you
have the courage to work on important problems instead of safe ones.
This maps directly to what I wrote about transmittable vs.
untransmittable knowledge. Hamming is rigorous, contrarian, and
deeply practical.
</p>
</div>
</div>
<div id="outline-container-org136cc07" class="outline-2">
<h2 id="org136cc07">4. Designing Data-Intensive Applications — Martin Kleppmann</h2>
<div class="outline-text-2" id="text-org136cc07">
<p>
The best systems engineering book of the last decade. Kleppmann builds
from simple primitives (logs, hashes, SSTables) all the way up to
distributed systems, always grounding abstractions in the physical
realities they paper over. Even if you never build a distributed
database, the <i>way</i> Kleppmann thinks will change how you design any
system. This book is first principles applied to data.
</p>
</div>
</div>
<div id="outline-container-org82e727e" class="outline-2">
<h2 id="org82e727e">5. Programmers at Work — Susan Lammers</h2>
<div class="outline-text-2" id="text-org82e727e">
<p>
Interviews with 19 legendary programmers from the 1980s. Bill Gates,
Andy Hertzfeld, Charles Simonyi, and others. What makes it timeless
is the focus on <i>how</i> they think about problems, not what they built.
You start to see patterns across how these minds approach complexity.
</p>
</div>
</div>
<div id="outline-container-orgaaf1850" class="outline-2">
<h2 id="orgaaf1850">6. The UNIX Programming Environment — Kernighan &amp; Pike</h2>
<div class="outline-text-2" id="text-orgaaf1850">
<p>
I live the Unix philosophy every day. Reading it from the source is
different than absorbing it osmotically. Kernighan and Pike do not
just describe the philosophy. They <i>demonstrate</i> it, building real
tools from shell pipelines, showing how composability creates power
that no monolith can match. Every time I write <code>curl | jq</code> or compose
tools in Emacs, I am living this book. My OneLoop agent (read, write,
edit, bash as four primitives) is an example of Unix way of doing things.
</p>
</div>
</div>
<div id="outline-container-org46ec8c5" class="outline-2">
<h2 id="org46ec8c5">7. Structure and Interpretation of Computer Programs — Abelson &amp; Sussman</h2>
<div class="outline-text-2" id="text-org46ec8c5">
<p>
The spiritual ancestor of everything I love about Lisps.
Homoiconicity. Functions as first-class citizens. Building abstractions
upward from the smallest possible primitives. SICP teaches you to
think about computation itself, not any particular language. If you
are a Clojure programmer and you have not read it cover to cover, fix
that.
</p>
</div>
</div>
<div id="outline-container-orga70434a" class="outline-2">
<h2 id="orga70434a">8. The Design of Everyday Things — Don Norman</h2>
<div class="outline-text-2" id="text-orga70434a">
<p>
Not a software book, and that is the point. Norman's central idea is
that good design is invisible and bad design blames the user. This
applies to everything from Makefile help targets to agent tool
interfaces. Your self-documenting system? Your one obvious path? Your
inspectability obsession? Norman gives you the design vocabulary to
articulate <i>why</i> something feels wrong and <i>how</i> to fix it.
</p>
</div>
</div>
<div id="outline-container-org5e0977b" class="outline-2">
<h2 id="org5e0977b">9. Computer Power and Human Reason — Joseph Weizenbaum</h2>
<div class="outline-text-2" id="text-org5e0977b">
<p>
Weizenbaum wrote ELIZA in 1966, then spent the rest of his career
warning about delegating human judgment to machines. He is not
anti-computer. He is pro-human. He argues that some things should not
be computed, not because they cannot be, but because doing so corrupts
the thinking. Reading this in 2026, in the middle of the AI hype
cycle, feels like finding a kindred spirit from fifty years ago. This
is the philosophical depth behind "the agent is not the point."
</p>
</div>
</div>
<div id="outline-container-org6a94545" class="outline-2">
<h2 id="org6a94545">10. The Mythical Man-Month — Frederick Brooks</h2>
<div class="outline-text-2" id="text-org6a94545">
<p>
The original essay on why adding people to a late project makes it
later. But it is really about something deeper: the irreducible
complexity of communication and the necessity of conceptual integrity
in software. Brooks' concept of conceptual integrity (a system should
reflect one set of design ideas, not a committee's compromises) is my
oneness principle by another name. The anniversary edition includes
"No Silver Bullet," which is even more relevant in the age of "AI will
solve everything."
</p>

<p>
&#x2014;
</p>

<p>
These are not the only books I have read. They are the ones I keep
coming back to. The ones where I will catch myself mid-conversation
reaching for an idea and realizing it came from one of these pages. If
you have read them, you know what I mean. If you have not, start with
1, 2, and 9.
</p>
</div>
</div>
<div class="taglist"><a href="https://www.birkey.co/tags.html">Tags</a>: <a href="https://www.birkey.co/tag-books.html">books</a> <a href="https://www.birkey.co/tag-engineering.html">engineering</a> </div></div>
<div id="postamble" class="status"><br><center>
	      <div style="display: inline-block; vertical-align:middle;"></div></div>
</body>
</html>
